notes/lde-quantum-algorithm-note.tex
%& /home/emendoza/.config/emacs/.local/cache/org/persist/f4/14138b-a184-42b4-ab37-3bfb904304cf-84b7124aefedcdcaa21b527f6d752364
% Created 2025-10-19 Sun 12:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{em-mathtools}
\usepackage[a4paper,margin=2cm]{geometry}

%% ox-latex features:
%   !announce-start, !guess-pollyglossia, !guess-babel, !guess-inputenc, maths,
%   !announce-end.

\usepackage{amsmath}
\usepackage{amssymb}

%% end ox-latex features


% end precompiled preamble
\ifcsname endofdump\endcsname\endofdump\fi

\author{Euan Mendoza}
\date{\today}
\title{LDE Quantum Algorithm Note}
\hypersetup{
 pdfauthor={Euan Mendoza},
 pdftitle={LDE Quantum Algorithm Note},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Linear Differential Equations (LDE)}
\label{sec:orgd8b0fd8}

Recall that a differential equation that is written in terms of it's derivative. For example Schrodinger's equation is a differential equation,

\begin{align}
i\hbar \frac{\partial}{\partial t} \ket{\Psi(t)} = \hat{H}\ket{\Psi(t)}
\end{align}

A linear differential equation (LDE) is an equation where each derivative

\begin{align}
c_{0}f(x) + c_{1}\frac{df(x)}{dx} + c_{2}\frac{df^{2}(x)}{dx^{2}}\cdots c_{k-1}\frac{df^{k-1}(x)}{dx^{k-1}} + c_{k} = 0
\end{align}

Solving LDE's is incredibly important in material science, physics and economics.
\end{document}
